Revit 2027 API
LightFamily.GetLightSourceTransform Method
 Returns a Transform value for the transform of light source.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetLightSourceTransform()
Public Function GetLightSourceTransform As Transform
public:
Transform^ GetLightSourceTransform()
member GetLightSourceTransform : unit -> Transform
Return Value
Transform
 The light source transform.
Remarks
 When the user moves or rotates the light source in family editor, the returned Transform gets changed accordingly.
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace